doe-ws/app/controllers/donations_controller.rb

  def index
    @donations = Donation.all
---
SELECT "donations".* FROM "donations"

  def show
    @donation = Donation.find(params[:id])
---
SELECT "donations".* FROM "donations" WHERE "donations"."id" = ? LIMIT 1  [["id", "1"]]

  def create
    @donation = Donation.new(params[:donation])

    respond_to do |format|
      if @donation.save
---
INSERT INTO "donations" ("created_at", "donation_date", "donation_description", "institution_id", "updated_at", "user_id") VALUES (?, ?, ?, ?, ?, ?)

  def destroy
    @donation = Donation.find(params[:id])
    @donation.destroy
---
SELECT "donations".* FROM "donations" WHERE "donations"."id" = ? LIMIT 1  [["id", "1"]]
DELETE FROM "donations" WHERE "donations"."id" = ?  [["id", 1]]