doe-ws/app/controllers/institutions_controller.rb

  def index
    @institutions = Institution.order("razao_social")
---
SELECT "institutions".* FROM "institutions" ORDER BY razao_social

  def institution_by_donation
    donation_preference = params[:preference]

    @institutions = Institution.find(:all, :conditions => ["donation_preference LIKE ?", "%#{donation_preference}%"], :order => "razao_social ASC")
---
SELECT "institutions".* FROM "institutions" WHERE (donation_preference LIKE '%Cesta Básica%') ORDER BY razao_social ASC

  def show
    @institution = Institution.find(params[:id])
---
SELECT "institutions".* FROM "institutions" WHERE "institutions"."id" = ? LIMIT 1  [["id", "index"]]

  def edit
    @institution = Institution.find(params[:id])
---
SELECT "institutions".* FROM "institutions" WHERE "institutions"."id" = ? LIMIT 1  [["id", "3"]]

  def create
    @institution = Institution.new(params[:institution])

    respond_to do |format|
      if @institution.save
---
INSERT INTO "institutions" ("address", "cidade", "cnpj", "codigo", "created_at", "donation_preference", "email", "fax", "fone", "latitude", "longitude", "razao_social", "rd", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?)

  def update
    @institution = Institution.find(params[:id])

    respond_to do |format|
      if @institution.update_attributes(params[:institution])
---
SELECT "institutions".* FROM "institutions" WHERE "institutions"."id" = ? LIMIT 1  [["id", "1"]]
UPDATE "institutions" SET "cnpj" = '09.796.319/0001-40', "address" = 'AV. SAO PAULO, N. 373 - RECIFE - Pernambuco - Brasil', "updated_at" = '2013-11-06 16:55:12.575402' WHERE "institutions"."id" = 1

  def destroy
    @institution = Institution.find(params[:id])
    @institution.destroy
---
SELECT "institutions".* FROM "institutions" WHERE "institutions"."id" = ? LIMIT 1  [["id", "1"]]
DELETE FROM "institutions" WHERE "institutions"."id" = ?  [["id", 1]]