doe-ws/app/controllers/api/v1/registrations_controller.rb

  def create
    @user = User.create(params[:user])
    #build_resource
    #resource.skip_confirmation!
    if @user.save
---
INSERT INTO "users" ("authentication_token", "confirmation_sent_at", "confirmation_token", "confirmed_at", "created_at", "current_sign_in_at", "current_sign_in_ip", "donation_preference", "email", "encrypted_password", "last_sign_in_at", "last_sign_in_ip", "name", "remember_created_at", "reset_password_sent_at", "reset_password_token", "sign_in_count", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?)
UPDATE "users" SET "last_sign_in_at" = '2013-10-24 01:08:59.447161', "current_sign_in_at" = '2013-10-24 01:08:59.447161', "last_sign_in_ip" = '127.0.0.1', "current_sign_in_ip" = '127.0.0.1', "sign_in_count" = 1, "updated_at" = '2013-10-24 01:08:59.448551' WHERE "users"."id" = 2