doe-ws/app/controllers/api/v1/sessions_controller.rb

  def destroy
    warden.authenticate!(:scope => resource_name, :recall => "#{controller_path}#failure")
    current_user.update_column(:authentication_token, nil)
---
UPDATE "users" SET "last_sign_in_at" = '2013-11-18 01:06:15.799162', "current_sign_in_at" = '2013-11-18 01:20:50.695169', "last_sign_in_ip" = '192.168.1.3', "current_sign_in_ip" = '127.0.0.1', "sign_in_count" = 35, "updated_at" = '2013-11-18 01:20:50.696583' WHERE "users"."id" = 1